//
//  JTTextContentConfig.m
//  JTSocial
//
//  Created by apple on 2017/11/21.
//  Copyright © 2017年 JTTeam. All rights reserved.
//

#import "JTTextContentConfig.h"

@implementation JTTextContentConfig

- (CGSize)contentSize:(NIMMessage *)message
{
    CGSize textSize = [Utility getTextString:message.text textFont:Font(JTMessageTextFont) frameWidth:(JTBubbleMaxWidth-28) attributedString:[self contenText:message]];
    return CGSizeMake(textSize.width+28, textSize.height+20);
}

- (NSMutableAttributedString *)contenText:(NIMMessage *)message
{
    NSMutableAttributedString *string = [[NSMutableAttributedString alloc] init];
    NSString *text = [message.text stringByReplacingOccurrencesOfString:@"🐜ܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻܻ" withString:@"🐜"];
    if ([text rangeOfString:@"ส็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็ส็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็ส็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็"].location != NSNotFound)  {
        text = @"我是傻逼";
    }
    [string zt_setText:text];
    [string addAttribute:NSFontAttributeName value:Font(JTMessageTextFont) range:NSMakeRange(0, string.length)];
    return string;
}

@end
